In [17]:
# Add Matplotlib inline magic command will help update charts automatically
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [18]:
# Files to load
city_data_to_load = ("resources/city_data.csv")
ride_data_to_load = ("resources/ride_data.csv")

In [19]:
#Read the file and make dataframe
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [20]:
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [21]:
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [22]:
#check data is clean ,check rows with nulls, datatype, find total number of data for city
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [23]:
# check nulls 0 means no nulls in this df
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [26]:
#good both df got no nulls ,now check datatype , driver counts = int 64 good to go
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [27]:
# Get the unique values of the type of city.this shows how many data points are there in this df in col type we have 3 options 
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [28]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [29]:
sum(city_data_df["type"]=="Suburban")

36

In [30]:
sum(city_data_df["type"]=="Rural")

18

In [24]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [25]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [12]:
#date showing as object need to date 
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [31]:
ride_data_df['date'] = pd.to_datetime(ride_data_df['date'])

In [32]:
ride_data_df.dtypes

city               object
date       datetime64[ns]
fare              float64
ride_id             int64
dtype: object

In [33]:
ride_data_df

                    city                date   fare        ride_id
0     Lake Jonathanshire 2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport 2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth 2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort 2019-02-10 23:22:03  23.44  5149245426178
4             South Jack 2019-03-06 04:28:35  34.58  3908451377344
...                  ...                 ...    ...            ...
2370         Michaelberg 2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury 2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime 2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather 2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview 2019-04-25 10:20:13  55.84  9990581345298

[2375 rows x 4 columns]

In [36]:
#now merge 2 df find common column that is "city"
pyber_city_ride_df = pd.merge(ride_data_df,city_data_df, on=["city", "city"])

In [37]:
#combined df ready 
pyber_city_ride_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,Lake Jonathanshire,2019-04-07 20:51:11,31.25,4441251834598,5,Urban
2,Lake Jonathanshire,2019-03-09 23:45:55,19.89,2389495660448,5,Urban
3,Lake Jonathanshire,2019-04-07 18:09:21,24.28,7796805191168,5,Urban
4,Lake Jonathanshire,2019-01-02 14:14:50,13.89,424254840012,5,Urban
...,...,...,...,...,...,...
2370,West Heather,2019-04-18 19:33:12,46.60,3671003215967,4,Rural
2371,West Heather,2019-03-02 21:04:10,20.99,5766454453070,4,Rural
2372,West Heather,2019-03-06 20:06:51,48.11,2570548892682,4,Rural
2373,West Heather,2019-02-02 06:28:04,53.07,2462950442268,4,Rural
2374,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural